{
  "name": "Arreglo",
  "brief": "Un arreglo es una lista de datos",
  "description": "Un arreglo es una lista de datos. es posible tener un arreglo de cualquier tipo de datos.  Cada pieza de datos en un arreglo es identificado a través de un índice representando su posición en el arreglo. El primer elemento del arreglo es <b>[0]</b>, el segundo elemento es <b>[1]</b>, y así sucesivamente. Los arreglos son similares a los objetos, así que debe ser creados con la palabra reservada <b>new</b>.<br/>\n<br/>\n Cada arreglo tiene una variable <b>length</b>, la cual es un valor entero que guarda el número total de elementos en el arreglo. Nota que dado que el número de indice empieza en 0 (no en 1), el último valor de un arreglo array de tamaño <b>length</b> 5 deberá ser referenciado como<b>array[4]</b> (esto es, <b>length</b> menos 1), no <b>array[5]</b>, el cual lanzaría un error.<br/>\n<br/>\n Otra confusión común es la diferencia entre usar <b>length</b> para obtener el tamaño de un arreglo y <b>length()</b> para obtener el tamaño de una cadena de tipo String. Nota la presencia de paréntesis cuando se trabaja con cadenas. (<b>array.length</b> es una variable, mientras que <b>String.length()</b> es un método específico de la clase String.)\n",
  "constructors": ["datatype[] var", "var[element] = value", "var.length"],
  "classFields": [],
  "methods": [],
  "related": [],
  "type": "class",
  "classanchor": "Array",
  "category": "Data",
  "subcategory": "Composite",
  "parameters": [
    {
      "name": "datatype",
      "description": " Cualquier tipo de dato primitivo o compuesto, incluyendo clases definidas por el usuario",
      "type": []
    },
    { "name": "var", "description": "cualquier nombre de variable válido", "type": [] },
    {
      "name": "element",
      "description": "int: no debe exceder la longitud del arreglo (length) menos 1",
      "type": []
    },
    {
      "name": "value",
      "description": " datos a asignar al elemento del arreglo. Debe ser del mismo tipo  de datos que el arreglo",
      "type": []
    }
  ]
}
