{
  "brief": "Sets the current alignment for drawing text",
  "related": [
    "loadFont_",
    "PFont",
    "text_",
    "textSize_",
    "textAscent_",
    "textDescent_"
  ],
  "name": "textAlign()",
  "description": "Sets the current alignment for drawing text. The parameters LEFT, CENTER, and\n RIGHT set the display characteristics of the letters in relation to the\n values for the <b>x</b> and <b>y</b> parameters of the <b>text()</b>\n function. <br />\n <br />\n An optional second parameter can be used to vertically align the text.\n BASELINE is the default, and the vertical alignment will be reset to BASELINE\n if the second parameter is not used. The TOP and CENTER parameters are\n straightforward. The BOTTOM parameter offsets the line based on the current\n <b>textDescent()</b>. For multiple lines, the final line will be aligned to\n the bottom, with the previous lines appearing above it. <br />\n <br />\n When using <b>text()</b> with width and height parameters, BASELINE is\n ignored, and treated as TOP. (Otherwise, text would by default draw outside\n the box, since BASELINE is the default setting. BASELINE is not a useful\n drawing mode for text drawn in a rectangle.) <br />\n <br />\n The vertical alignment is based on the value of <b>textAscent()</b>, which\n many fonts do not specify correctly. It may be necessary to use a hack and\n offset by a few pixels by hand so that the offset looks correct. To do this\n as less of a hack, use some percentage of <b>textAscent()</b> or\n <b>textDescent()</b> so that the hack works even if you change the size of\n the font.",
  "syntax": ["textAlign(alignX)", "textAlign(alignX, alignY)"],
  "returns": "void",
  "type": "function",
  "category": "typography",
  "subcategory": "attributes",
  "parameters": [
    {
      "name": "alignX",
      "description": "horizontal alignment, either LEFT, CENTER, or RIGHT",
      "type": ["int"]
    },
    {
      "name": "alignY",
      "description": "vertical alignment, either TOP, BOTTOM, CENTER, or BASELINE",
      "type": ["int"]
    }
  ]
}
