{
  "brief": "Copies a pixel or rectangle of pixels using different blending modes",
  "related": ["alpha_", "copy_", "PImage_blendColor_"],
  "name": "blend()",
  "description": "Blends a region of pixels into the image specified by the <b>img</b>\n parameter. These copies utilize full alpha channel support and a choice\n of the following modes to blend the colors of source pixels (A) with the\n ones of pixels in the destination image (B):<br/>\n <br/>\n BLEND - linear interpolation of colours: <b>C = A*factor + B</b><br/>\n <br/>\n ADD - additive blending with white clip: <b>C = min(A*factor + B, 255)</b><br/>\n <br/>\n SUBTRACT - subtractive blending with black clip: <b>C = max(B - A*factor,\n 0)</b><br/>\n <br/>\n DARKEST - only the darkest colour succeeds: <b>C = min(A*factor, B)</b><br/>\n <br/>\n LIGHTEST - only the lightest colour succeeds: <b>C = max(A*factor, B)</b><br/>\n <br/>\n DIFFERENCE - subtract colors from underlying image.<br/>\n <br/>\n EXCLUSION - similar to DIFFERENCE, but less extreme.<br/>\n <br/>\n MULTIPLY - Multiply the colors, result will always be darker.<br/>\n <br/>\n SCREEN - Opposite multiply, uses inverse values of the colors.<br/>\n <br/>\n OVERLAY - A mix of MULTIPLY and SCREEN. Multiplies dark values,\n and screens light values.<br/>\n <br/>\n HARD_LIGHT - SCREEN when greater than 50% gray, MULTIPLY when lower.<br/>\n <br/>\n SOFT_LIGHT - Mix of DARKEST and LIGHTEST.\n Works like OVERLAY, but not as harsh.<br/>\n <br/>\n DODGE - Lightens light tones and increases contrast, ignores darks.\n Called \"Color Dodge\" in Illustrator and Photoshop.<br/>\n <br/>\n BURN - Darker areas are applied, increasing contrast, ignores lights.\n Called \"Color Burn\" in Illustrator and Photoshop.<br/>\n <br/>\n All modes use the alpha information (the highest byte) of source image\n pixels as the blending factor. If the source and destination regions are\n different sizes, the image will be automatically resized to match the\n destination size. If the <b>srcImg</b> parameter is not used, the\n display window is used as the source image.<br/>\n <br/>\n As of release 0149, this function ignores <b>imageMode()</b>.",
  "syntax": [
    "blend(sx, sy, sw, sh, dx, dy, dw, dh, mode)",
    "blend(src, sx, sy, sw, sh, dx, dy, dw, dh, mode)"
  ],
  "returns": "void",
  "type": "function",
  "category": "image",
  "subcategory": "pixels",
  "parameters": [
    {
      "name": "src",
      "description": "an image variable referring to the source image",
      "type": ["PImage"]
    },
    {
      "name": "sx",
      "description": "X coordinate of the source's upper left corner",
      "type": ["int"]
    },
    {
      "name": "sy",
      "description": "Y coordinate of the source's upper left corner",
      "type": ["int"]
    },
    { "name": "sw", "description": "source image width", "type": ["int"] },
    { "name": "sh", "description": "source image height", "type": ["int"] },
    {
      "name": "dx",
      "description": "X coordinate of the destination's upper left corner",
      "type": ["int"]
    },
    {
      "name": "dy",
      "description": "Y coordinate of the destination's upper left corner",
      "type": ["int"]
    },
    { "name": "dw", "description": "destination image width", "type": ["int"] },
    {
      "name": "dh",
      "description": "destination image height",
      "type": ["int"]
    },
    {
      "name": "mode",
      "description": "Either BLEND, ADD, SUBTRACT, LIGHTEST, DARKEST, DIFFERENCE, EXCLUSION, MULTIPLY, SCREEN, OVERLAY, HARD_LIGHT, SOFT_LIGHT, DODGE, BURN",
      "type": ["int"]
    }
  ]
}
