{
  "brief": "Dynamically converts a font to the format used by Processing.",
  "related": ["PFont", "textFont_", "text_", "loadFont_"],
  "name": "createFont()",
  "description": "Dynamically converts a font to the format used by Processing from a .ttf or\n .otf file inside the sketch's \"data\" folder or a font that's installed\n elsewhere on the computer. If you want to use a font installed on your\n computer, use the <b>PFont.list()</b> method to first determine the names\n for the fonts recognized by the computer and are compatible with this\n function. Not all fonts can be used and some might work with one operating\n system and not others. When sharing a sketch with other people or posting\n it on the web, you may need to include a .ttf or .otf version of your font\n in the data directory of the sketch because other people might not have the\n font installed on their computer. Only fonts that can legally be\n distributed should be included with a sketch.<br />\n <br />\n The <b>size</b> parameter states the font size you want to generate. The\n <b>smooth</b> parameter specifies if the font should be antialiased or not.\n The <b>charset</b> parameter is an array of chars that specifies the\n characters to generate.<br />\n <br />\n This function allows Processing to work with the font natively in the\n default renderer, so the letters are defined by vector geometry and are\n rendered quickly. In the <b>P2D</b> and <b>P3D</b> renderers, the function\n sets the project to render the font as a series of small textures. For\n instance, when using the default renderer, the actual native version of the\n font will be employed by the sketch, improving drawing quality and\n performance. With the <b>P2D</b> and <b>P3D</b> renderers, the bitmapped\n version will be used to improve speed and appearance, but the results are\n poor when exporting if the sketch does not include the .otf or .ttf file,\n and the requested font is not available on the machine running the sketch.",
  "syntax": [
    "createFont(name, size)",
    "createFont(name, size, smooth)",
    "createFont(name, size, smooth, charset)"
  ],
  "returns": "PFont",
  "type": "function",
  "category": "typography",
  "subcategory": "loading_displaying",
  "parameters": [
    {
      "name": "name",
      "description": "name of the font to load",
      "type": ["String"]
    },
    {
      "name": "size",
      "description": "point size of the font",
      "type": ["float"]
    },
    {
      "name": "smooth",
      "description": "true for an antialiased font, false for aliased",
      "type": ["boolean"]
    },
    {
      "name": "charset",
      "description": "array containing characters to be generated",
      "type": ["char[]"]
    }
  ]
}
