{
  "brief": "A class to handle keyboard events",
  "related": [
    "key",
    "keyCode",
    "keyPressed",
    "keyPressed_",
    "keyReleased_",
    "keyTyped_",
    "MouseEvent"
  ],
  "name": "KeyEvent",
  "description": "A <b>KeyEvent</b> object contains information about a keyboard event that has occurred. This object is automatically passed to the keyboard event functions (<b>keyPressed()</b>, <b>keyReleased()</b>, and <b>keyTyped()</b>) when they are called with an event parameter.<br/><br/>The KeyEvent object provides additional information beyond what's available in the global keyboard variables (<b>key</b> and <b>keyCode</b>). For most basic keyboard interactions, using the global variables is sufficient and more convenient. However, the KeyEvent object is useful when you need more detailed information about the keyboard event, such as modifier keys that were held down or the raw key codes.<br/><br/>For Java programmers: This is Processing's interface to Java's KeyEvent class. You can access the underlying Java KeyEvent using <b>event.getNative()</b>. The key constants (like <b>UP</b>, <b>DOWN</b>) are simplified versions of Java's KeyEvent constants (like <b>KeyEvent.VK_UP</b>, <b>KeyEvent.VK_DOWN</b>).",
  "syntax": ["KeyEvent event"],
  "returns": "KeyEvent",
  "type": "class",
  "category": "input",
  "subcategory": "keyboard",
  "methods": [
    {
      "anchor": "getKey",
      "name": "getKey()",
      "desc": "Returns the character that was typed (same as global 'key' variable)"
    },
    {
      "anchor": "getKeyCode",
      "name": "getKeyCode()",
      "desc": "Returns the key code for special keys (same as global 'keyCode' variable)"
    },
    {
      "anchor": "isShiftDown",
      "name": "isShiftDown()",
      "desc": "Returns true if the Shift key was held down during the event"
    },
    {
      "anchor": "isControlDown",
      "name": "isControlDown()",
      "desc": "Returns true if the Control key was held down during the event"
    },
    {
      "anchor": "isAltDown",
      "name": "isAltDown()",
      "desc": "Returns true if the Alt key was held down during the event"
    },
    {
      "anchor": "isMetaDown",
      "name": "isMetaDown()",
      "desc": "Returns true if the Meta/Cmd key was held down during the event"
    },
    {
      "anchor": "isAutoRepeat",
      "name": "isAutoRepeat()",
      "desc": "Returns true if this event was generated by key auto-repeat"
    },
    {
      "anchor": "getNative",
      "name": "getNative()",
      "desc": "Returns the underlying Java KeyEvent object"
    }
  ]
}
