{
  "brief": "Called once every time a key is pressed",
  "related": ["key", "keyCode", "keyPressed", "keyReleased_", "keyTyped_", "KeyEvent"],
  "name": "keyPressed()",
  "description": "The <b>keyPressed()</b> function is called once every time a key is pressed. The key that was pressed is stored in the <b>key</b> variable.<br/><br/>For non-ASCII keys, use the <b>keyCode</b> variable. The keys included in the ASCII specification (BACKSPACE, TAB, ENTER, RETURN, ESC, and DELETE) do not require checking to see if the key is coded; for those keys, you should simply use the <b>key</b> variable directly (and not <b>keyCode</b>). If you're making cross-platform projects, note that the ENTER key is commonly used on PCs and Unix, while the RETURN key is used on Macs. Make sure your program will work on all platforms by checking for both ENTER and RETURN.<br/><br/>This function can be called with or without a <b>KeyEvent</b> parameter. When called with the parameter, you get access to additional information about the keyboard event, including modifier keys (Shift, Ctrl, Alt, Meta) that were held down and whether the event was generated by auto-repeat.<br/><br/>Because of how operating systems handle key repeats, holding down a key may cause multiple calls to <b>keyPressed()</b>. The rate of repeat is set by the operating system, and may be configured differently on each computer.<br/><br/>Note that there is a similarly named boolean variable called <b>keyPressed</b>. See its reference page for more information.<br/><br/>Mouse and keyboard events only work when a program has <b>draw()</b>. Without <b>draw()</b>, the code is only run once and then stops listening for events.<br/><br/>With the release of macOS Sierra, Apple changed how key repeat works, so keyPressed may not function as expected. See <a href=\"https://github.com/processing/processing/wiki/Troubleshooting#key-repeat-on-macos-sierra\">here</a> for details of the problem and how to fix it.",
  "syntax": ["keyPressed()", "keyPressed(event)"],
  "returns": "void",
  "type": "function",
  "category": "input",
  "subcategory": "keyboard",
  "parameters": [
    { "name": "event", "description": "the KeyEvent", "type": ["KeyEvent"] }
  ]
}
