{
  "brief": "Set various hints and hacks for the renderer",
  "related": ["PGraphics", "size_"],
  "name": "hint()",
  "description": "Set various hints and hacks for the renderer. This is used to handle\n obscure rendering features that cannot be implemented in a consistent\n manner across renderers. Many options will often graduate to standard\n features instead of hints over time.\n <br/> <br/>\n <b>hint(ENABLE_OPENGL_4X_SMOOTH)</b>- Enable 4x anti-aliasing for P3D. This\n can help force anti-aliasing if it has not been enabled by the user. On\n some graphics cards, this can also be set by the graphics driver's\n control panel, however not all cards make this available. This hint must\n be called immediately after the <b>size()</b> command because it resets the\n renderer, obliterating any settings and anything drawn (and like <b>size()</b>,\n re-running the code that came before it again).\n <br/> <br/>\n <b>hint(DISABLE_OPENGL_2X_SMOOTH)</b> - In Processing 1.0, Processing always\n enables 2x smoothing when the P3D renderer is used. This hint disables\n the default 2x smoothing and returns the smoothing behavior found in\n earlier releases, where <b>smooth()</b> and <b>noSmooth()</b> could be used to enable\n and disable smoothing, though the quality was inferior.\n <br/> <br/>\n <b>hint(ENABLE_NATIVE_FONTS)</b> - Use the native version fonts when they are\n installed, rather than the bitmapped version from a .vlw file. This is\n useful with the default (or JAVA2D) renderer setting, as it will improve\n font rendering speed. This is not enabled by default, because it can be\n misleading while testing because the type will look great on your\n machine (because you have the font installed) but lousy on others'\n machines if the identical font is unavailable. This option can only be\n set per-sketch, and must be called before any use of <b>textFont()</b>.\n <br/> <br/>\n <b>hint(DISABLE_DEPTH_TEST)</b> - Disable the zbuffer, allowing you to draw on\n top of everything at will. When depth testing is disabled, items will be\n drawn to the screen sequentially, like a painting. This hint is most\n often used to draw in 3D, then draw in 2D on top of it (for instance, to\n draw GUI controls in 2D on top of a 3D interface). Starting in release\n 0149, this will also clear the depth buffer. Restore the default with\n <b>hint(ENABLE_DEPTH_TEST)</b>, but note that with the depth buffer cleared,\n any 3D drawing that happens later in <b>draw()</b> will ignore existing shapes\n on the screen.\n <br/> <br/>\n <b>hint(ENABLE_DEPTH_SORT)</b> - Enable primitive z-sorting of triangles and\n lines in P3D and OPENGL. This can slow performance considerably, and the\n algorithm is not yet perfect. Restore the default with <b>hint(DISABLE_DEPTH_SORT)</b>.\n <br/> <br/>\n <b>hint(DISABLE_OPENGL_ERROR_REPORT)</b> - Speeds up the P3D renderer setting\n by not checking for errors while running. Undo with <b>hint(ENABLE_OPENGL_ERROR_REPORT)</b>.\n <br/> <br/>\n <b>hint(ENABLE_BUFFER_READING)</b> - Depth and stencil buffers in P2D/P3D will be\n down-sampled to make PGL#readPixels work with multisampling. Enabling this\n introduces some overhead, so if you experience bad performance, disable\n multisampling with <b>noSmooth()</b> instead. This hint is not intended to be\n enabled and disabled repeatedly, so call this once in <b>setup()</b> or after\n creating your PGraphics2D/3D. You can restore the default with\n <b>hint(DISABLE_BUFFER_READING)</b> if you don't plan to read depth from\n this <b>PGraphics</b> anymore.\n <br/> <br/>\n <b>hint(ENABLE_KEY_REPEAT)</b> - Auto-repeating key events are discarded\n by default (works only in P2D/P3D); use this hint to get all the key events\n (including auto-repeated). Call <b>hint(DISABLE_KEY_REPEAT)</b> to get events\n only when the key goes physically up or down.\n <br/> <br/>\n <b>hint(DISABLE_ASYNC_SAVEFRAME)</b> - P2D/P3D only - <b>save()</b> and <b>saveFrame()</b>\n will not use separate threads for saving and will block until the image\n is written to the drive. This was the default behavior in 3.0b7 and before.\n To enable, call <b>hint(ENABLE_ASYNC_SAVEFRAME)</b>.",
  "syntax": ["graphics.hint(which)"],
  "returns": "void",
  "type": "method",
  "category": "rendering",
  "subcategory": "",
  "classanchor": "PGraphics",
  "parameters": [
    {
      "name": "graphics",
      "description": " any object of the type PGraphics",
      "type": ["PGraphics"]
    },
    {
      "name": "which",
      "description": "name of the hint to be enabled or disabled",
      "type": ["int"]
    }
  ]
}
