{"constructors":["SoundFile(parent, path)","SoundFile(parent, path, cache)"],"classname":"SoundFile","examples":"","related":[],"methods":[{"name":"removeFromCache()","desc":"Remove this SoundFile's decoded audio sample from the cache, allowing\n it to be garbage collected once there are no more references to this\n SoundFile."},{"name":"channels()","desc":"Returns the number of channels of the soundfile."},{"name":"cue()","desc":"Cues the playhead to a fixed position in the soundfile."},{"name":"duration()","desc":"Returns the duration of the soundfile in seconds."},{"name":"frames()","desc":"Returns the number of frames of this soundfile."},{"name":"play()","desc":"Starts the playback of the soundfile. Only plays to the end of the\n audiosample once."},{"name":"jump()","desc":"Jump to a specific position in the soundfile while continuing to play."},{"name":"pause()","desc":"Stop the playback of the file, but cue it to the current position so that the\n next call to play() will continue playing where it left off."},{"name":"isPlaying()","desc":"Check whether this soundfile is currently playing."},{"name":"loop()","desc":"Starts playback which will loop at the end of the soundfile."},{"name":"amp()","desc":"Change the amplitude/volume of this audiosample."},{"name":"pan()","desc":"Move the sound in a stereo panorama. Only works for mono soundfiles!"},{"name":"rate()","desc":"Set the playback rate of the soundfile."},{"name":"stop()","desc":"Stops the playback."}],"csspath":"../../","isLibrary":"true","classFields":[],"description":"This is a Soundfile player which allows to play back and manipulate sound\n files. Supported formats are: WAV, AIF/AIFF, and MP3.","classanchor":"libraries/sound/SoundFile.html","parameters":[{"name":"parent","description":"typically use \"this\"","type":["PApplet"]},{"name":"path","description":"filename of the sound file to be loaded","type":["String"]},{"name":"cache","description":"keep the sound data in RAM once it has been decoded (default: true).\n            Note that caching essentially disables garbage collection for the\n            SoundFile data, so if you are planning to load a large number of audio\n            files, you should set this to false.","type":["boolean"]}]}